---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalResourceMatchOptions
source: html/524f93fc-9afa-f07f-dc76-10ca32c0f9ea.htm
---
# ExternalResourceMatchOptions Members

Constructs new instance with specified resource type.